{
  "c54e6850-013b-42ee-9df3-27cf8e01e2d8": "The figure features a bold and simple design highlighting \"Chapter 2.\" It consists of the following elements:\n\n- **Background Color**: A deep maroon surrounding the main content.\n- **Main Element**: A prominent, light orange circle at the center containing the number \"2\" in a large, white font.\n- **Label**: The word \"Chapter\" is displayed above the circle in a bold, white font, indicating the section of the text or book.\n\n**Key Takeaways**:\n- The design emphasizes the importance of Chapter 2, suggesting a new section or topic.\n- The color contrast (maroon and orange) is visually striking, enhancing readability and focus on the chapter designation. \n- Overall, the layout indicates a structured approach to navigating the content.",
  "235e8480-1b52-41a5-a9a3-1e9d9151c577": "The figure presents a framework for \"Global Strategies\" divided into two primary levels: **Country Level** and **Institutional Level**. \n\n### Key Components:\n\n1. **Country Level:**\n   - Focuses on specific countries that are significant in global education and strategy, including:\n     - USA\n     - Canada\n     - Australia\n     - EU\n     - Japan\n     - China\n\n2. **Institutional Level:**\n   - This section is further divided into:\n     - **Institutional Endowments:** Highlighted as \"Endowments as Enablers,\" suggesting their role in facilitating institutional capabilities.\n     - **Models of International Engagement:** This emphasizes strategies for global collaboration and presence.\n\n### Examples Provided:\n- **Global Centres:**\n  - Notable institutions mentioned include Columbia University, University of Chicago, and Harvard University.\n  \n- **Hybrid Joint Campuses:**\n  - Collaboration examples between institutions such as King's College London and Dresden University of Technology.\n\n### Key Takeaways:\n- The diagram illustrates a structured approach to understanding global educational strategies.\n- It emphasizes the importance of country-specific context and the role of institutional endowments in fostering international engagement.\n- Specific examples of institutions provide concrete references to highlight successful global strategies in higher education.",
  "9a18ed42-03e8-49e7-8633-2dbf6643f899": "The figure outlines \"Indian Strategies\" at two levels: the **Country Level** and the **Institutional Level**. \n\n### Key components:\n- **Country Level**: \n  - **Study in India**: This element suggests a focus on domestic education initiatives.\n\n- **Institutional Level**: \n  - **Institutional Endowments**: Highlights Indian practices involving institutions like IIT Delhi and IIM Ahmedabad, exploring funding frameworks and sustainability.\n  - **Models of International Engagement**: Addresses partnerships and collaborations with global entities, referencing **Global Centres** like IIT Madras.\n\n### Additional Note:\n- There is a mention of **Constraints in Scaling up Endowment Model in India**, indicating potential challenges faced in enhancing the endowment strategies within Indian institutions.\n\n### Summary:\nThe diagram serves as a strategic framework that distinguishes between country-wide educational initiatives and institutional investment practices, emphasizing practicality and the need for global collaboration while acknowledging existing challenges.",
  "0fd598bd-d340-44e0-87b8-7117268dc8ca": "The figure titled \"Internationalisation of Higher Education in India\" features stylized depictions of hands raised, symbolizing participation and engagement. The hands are shown in various colors, suggesting diversity and inclusivity in the context of higher education. \n\n### Key Elements:\n- **Title**: Clearly states the focus on internationalization within the higher education sector in India.\n- **Visuals**: The raised hands represent active involvement and collaboration, emphasizing participation in global educational frameworks.\n- **Color Scheme**: Uses vibrant colors to convey energy and dynamism related to international education initiatives.\n\n### Key Takeaways:\n- Highlights the importance of inclusivity and participation in the global education landscape.\n- Suggests a movement towards enhancing India's presence and collaboration in international higher education.\n- Reflects a commitment to diversity, cooperation, and shared learning experiences. \n\nThis figure serves as a visual metaphor for the ongoing efforts and aspirations in the internationalization of education in India.",
  "db068ee0-e1c1-4778-b7df-7c9a0d95ece2": "The figure titled \"Internationalisation of Higher Education in India\" visually represents the concept of global engagement in Indian education. It features stylized silhouettes of hands raised, symbolizing participation, diversity, and collaboration among students and educators. \n\n**Key Elements:**\n\n- **Main Title:** Clearly indicates the focus on the internationalization aspect of higher education in India.\n- **Visual Representation:** The rising hands may signify aspirations, shared goals, and unity, suggesting engagement with global educational standards and opportunities.\n- **Color Scheme:** A mix of maroon and orange, evoking a sense of warmth, enthusiasm, and dynamism.\n- **Key Takeaways:** The figure emphasizes the growing importance and need for India to enhance its global academic presence, fostering cross-border collaborations and exchange programs.\n\nThis description aids in retrieving context on India's educational reforms and international outreach initiatives.",
  "e829bd60-c441-4208-a065-7bbef541ede5": "**Figure Description:**\n\n- **Title:** Participants in Mobility Activities under the Erasmus+ and its Predecessors since 1987\n- **Source:** Erasmus+ Annual Report, 2023\n- **Y-axis:** Number of participants (in millions) ranging from 0 to 16.\n- **X-axis:** Years from 1987-2023, with marked data points for specific years: 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, and 2023.\n\n**Key Data Points:**\n- The graph shows a significant upward trend in participant numbers from 7.1 million in the 1987-2013 period to 15.1 million in 2023.\n- Notable increases:\n  - 2014: 7.4 million\n  - 2015: 8.0 million\n  - 2016: 8.8 million\n  - 2017: 9.6 million\n  - 2018: 10.5 million\n  - 2019: 11.5 million\n  - 2020: 11.8 million\n  - 2021: 12.5 million\n  - 2022: 13.8 million\n  - 2023: 15.1 million\n\n**Key Takeaways:**\n- There has been a consistent increase in mobility participants over the years, reflecting the growing popularity and accessibility of the Erasmus+ program.\n- The data indicates a robust recovery and growth in participation post-2020, likely influenced by improved program offerings and increased international mobility opportunities.",
  "a4727e7e-821c-4765-9cb7-d0fa60b7d148": "The table presents a comparison of two prestigious universities—Harvard University and Cambridge University—focusing on their endowments, international initiatives, and outcomes.\n\n### Key Columns:\n1. **University**: Names of the institutions.\n2. **Endowment**: Amount of financial resources available.\n3. **INR (In approx. crores)**: Approximation of endowment in Indian Rupees.\n4. **Exchange Rate (Oct 2025)**: Currency exchange rates relevant to the values presented.\n5. **Key International Initiatives**: Notable programs and partnerships aimed at enhancing international engagement.\n6. **International Outcomes**: Percentage of international students or faculty.\n\n### Notable Values/Trends:\n- **Harvard University**:\n  - Endowment: USD 52.3 billion (~ 4,64,162 crores INR).\n  - Key initiatives include 20+ global research centers, financial aid for international students, partnerships across 57 countries, and faculty exchanges in over 30 nations.\n  - Outcomes: 24% of the student body consists of international students.\n\n- **Cambridge University**:\n  - Endowment: £2.6 billion (~ 39,890 crores INR).\n  - Key initiatives include the Cambridge-Africa Programme, research hubs in Singapore, India, and China, and global fellowship programs.\n  - Outcomes: 24% international faculty and 40% of students are international.\n\n### Summary:\nOverall, Harvard has a significantly larger endowment and emphasizes financial aid and globally connected research, while Cambridge highlights specific programs aimed at fostering partnerships in various regions. Both institutions have considerable international representation among students and faculty.",
  "9f338b92-352e-4ab6-a0b6-ccb4796c195a": "The table presents key details about various universities, focusing on their endowments, international initiatives, and outcomes. \n\n### Key Columns:\n1. **University**: Name and location of the institutions.\n2. **Endowment**: Financial endowment values in different currencies.\n3. **INR**: Equivalent endowment values in Indian Rupees (approximate).\n4. **Exchange Rate**: Current exchange rates for conversion.\n5. **Key International Initiatives**: Significant international collaborations and programs.\n6. **International Outcomes**: Results related to international enrollment and faculty integration.\n\n### Notable Values/Trends:\n- **NUS (Singapore)**: \n  - Endowment: SGD 5.9 billion (39,852 crores).\n  - Key initiatives include partnerships with Yale and Duke.\n  - Ranked in the global top 20.\n\n- **Tsinghua University (China)**: \n  - Endowment: USD 3.9 billion (34,612 crores).\n  - Notable 300% growth in international enrollment since 2010.\n\n- **Toronto University (Canada)**:\n  - Endowment: CAD 3.15 billion (19,587 crores).\n  - 25% of the student population is international.\n\n- **ETH Zurich (Switzerland)**:\n  - Endowment: CHF 804 million (14,791 crores).\n  - Noteworthy for having 40% international faculty.\n\nOverall, the data highlights a strong trend towards international collaboration and increasing foreign student enrollment across these institutions.",
  "07b37512-2a2e-4fe4-9ef7-564b180e9e5c": "### Figure 2.2: Survey Response on Various Objectives for Partnerships\n\n**Description:**\nThis figure presents a survey response summary regarding the objectives for partnerships, illustrated in a grid format with each cell representing a specific objective and its percentage of respondents supporting it.\n\n**Key Objectives and Percentages:**\n- **Collaborative Research:** 89%\n- **Joint Publications:** 83%\n- **Funding Opportunities:** 63%\n- **Technology Transfer:** 52%\n- **Student/Faculty Exchange:** 77%\n- **Curriculum Development:** 66%\n- **Curriculum Exchange:** 52%\n- **Joint Academic Degrees:** 51%\n- **Twinning Programmes:** 48%\n- **Other:** 14%\n\n**Key Takeaways:**\n- The highest priority objective is **Collaborative Research** (89%), indicating a strong preference for joint research initiatives.\n- **Joint Publications** follow closely at 83%, highlighting the importance of shared academic outputs.\n- Lower priorities include **Twinning Programmes** (48%) and the **Other** category (14%), suggesting less focus on these areas in comparison to collaborative efforts.\n- Overall, there is a significant interest in opportunities that enhance collaboration and exchange within academic partnerships.",
  "7335707c-52ad-4a03-9272-230b77b46e50": "The table presents a comparison of global centres established by universities, specifically focusing on the **Columbia University Global Centres**. \n\n### Key Columns:\n1. **University/Centre**: Identifies the institution.\n2. **Year**: The year the centre was established.\n3. **Locations (outside home country)**: Cities where the centres operate.\n4. **Focus Area**: Main objectives and areas of focus for the centre.\n5. **Features and Offerings**: Programs and services provided by the centre.\n\n### Notable Values/Trends:\n- **University/Centre**: Columbia University Global Centres.\n- **Year**: Established in **2009**.\n- **Locations**: Operates in **10 cities** including major international locations such as **Beijing**, **Nairobi**, and **Paris**.\n- **Focus Area**: Emphasizes **international collaboration**, **research** initiatives, and **academic programming**.\n- **Features and Offerings**: Provides diverse programmes related to **public health**, **environmental sustainability**, and **architecture**.\n\nOverall, the table highlights the global reach and diverse focus areas of Columbia University's engagement in international collaboration through its global centres.",
  "85b39457-55a7-4c9f-8719-8b0a0d22c2c9": "The table summarizes global academic centers established by three prominent universities: NYU, the University of Chicago, and Harvard. \n\n### Key Columns:\n1. **University/Centre**: Name of the institution.\n2. **Year**: Year of establishment or significant development.\n3. **Locations (outside home country)**: Cities where these centers are located.\n4. **Focus Area**: Main subjects or themes of study and research.\n5. **Features and Offerings**: Types of programs and services provided.\n\n### Notable Rows and Values:\n1. **NYU Global Academic Centres (2012)**:\n   - **Locations**: 12 cities (including Abu Dhabi, Berlin, Paris, Sydney).\n   - **Focus**: Study away programs and global research initiatives.\n   - **Features**: Offers undergraduate and graduate programs in various disciplines.\n\n2. **University of Chicago Global Centre (various years: 2003, 2010, 2013)**:\n   - **Locations**: 3 cities (Beijing, Delhi, Paris).\n   - **Focus**: Broad range of areas including science, public health, business, and law.\n   - **Features**: Provides academic and public programs, serving as a hub for global issues and alumni.\n\n3. **Harvard Global Research Centres (1999-2017)**:\n   - **Locations**: 16 cities (including Johannesburg, Hong Kong, Mexico City).\n   - **Focus**: Business, environmental science, leadership, and technology.\n   - **Features**: Emphasizes faculty research and international case study development.\n\n### Trends:\n- Increasing number of global centers over time, with Harvard having the widest reach and diverse focus areas.\n- Emphasis on various disciplines, reflecting a trend towards interdisciplinary research and global academic collaboration.",
  "8da7df21-00bf-438f-b4a4-1e012f110bd5": "The figure presents a comparative analysis of higher education features across six countries: United States, United Kingdom, Australia, Germany, China, and India (Target Model). Each country is represented in a labeled box with key points highlighting their strengths or distinctive features in education.\n\n### Key Details:\n\n- **United States**:\n  - Emphasizes strong research funding, diverse revenue sources, industry partnerships, career opportunities, and global recognition.\n\n- **United Kingdom**:\n  - Focuses on quality assurance, research excellence, global partnerships, language advantage, and cultural integration.\n\n- **Australia**:\n  - Highlights regional focus, student experience, industry integration, support services, and marketing strategy.\n\n- **Germany**:\n  - Underlines research focus, technical excellence, low or no tuition, industry collaboration, and language support.\n\n- **China**:\n  - Discusses infrastructure, government support, scholarship scale, cultural promotions, and economic integration.\n\n- **India (Target Model)**:\n  - Features cost advantage, IT/tech strength, use of English medium, cultural diversity, and traditional knowledge.\n\n### Key Takeaways:\nThe diagram succinctly illustrates the diverse strengths and distinctive educational characteristics of each country, which can serve as benchmarks or models for developing educational strategies globally. It reflects trends and priorities in the higher education landscape in each nation.",
  "b6c0d35b-3d10-48ca-9b12-954e2fa586c0": "The table presents examples of endowment-driven initiatives from two institutions:\n\n### Summary:\n- **Title:** Endowment Driven Examples of INIs\n- **Key Institutions:** IIT Delhi and IIM Ahmedabad\n\n### Key Columns:\n1. **Institution**\n2. **Launch Year**\n3. **Endowment Fund Amount:**\n   - Target Amount\n   - Amount Raised\n   - Number of Donors\n4. **Impact / Outcomes**\n5. **As On** (Date)\n\n### Notable Values and Trends:\n- **IIT Delhi (2019)**\n  - **Target Amount:** INR 10,000 crore by 2029\n  - **Amount Raised:** INR 500 crore (pledged donations)\n  - **Donors:** 425+\n  - **Impact:** Development of infrastructure and student scholarships.\n  \n- **IIM Ahmedabad (2020)**\n  - **Target Amount:** INR 1,000 crores by 2025\n  - **Amount Raised:** INR 615+ crores (total commitment) and INR 400+ crores (raised)\n  - **Donors:** 360+\n  - **Impact:** Establishment of new school and research centres.\n\n### Trends:\n- Both institutions aim for significant endowment goals to enhance educational facilities and student support.\n- IIT Delhi has a longer time frame (10 years) compared to IIM Ahmedabad (5 years) for achieving their targets.",
  "9a5ac8c8-8796-4ead-8e7b-a008dd9023c6": "The figure titled \"Pillars of IITM Global\" outlines the foundational elements aimed at establishing IITM as the world's first multinational university. It is structured like a building with four key pillars labeled as:\n\n1. **Startups**: Represents the focus on entrepreneurial ventures.\n   - Icon: An upward graph with a rocket, symbolizing growth.\n\n2. **Sponsored Research**: Emphasizes collaborative research funding.\n   - Icon: A handshake, indicating partnership.\n\n3. **IP & Tech Transfer**: Focuses on intellectual property and technology commercialization.\n   - Icon: Gears, representing innovation and technology.\n\n4. **International Academic Programs**: Pertains to global academic initiatives.\n   - Icon: A document with a checklist, suggesting structured programs.\n\nAt the top, the phrase \"Creating Continuous Value\" highlights the overarching goal of these pillars. \n\n**Aspiration**: To position IITM as a leader in international education.\n\n**Approach**: Described as a \"plug-and-play platform\" for integrating startups, research, academic programs, and IP initiatives globally.\n\nKey takeaways include the holistic approach towards innovation and education aimed at continuous value creation through structured pillars.",
  "01463a2a-2bb8-434d-bf84-6f7972b8f05a": "The figure titled \"Financial/Funding Support\" illustrates survey responses regarding the impact of scholarships on international student enrollment and the overlap between international admissions and funding bodies' application processes.\n\n### Key Components:\n- **Title**: Financial/Funding Support\n- **Sections**:\n  - **Impact of Scholarships on International Student Enrollment**: Divided into four categories based on relevance, showing the percentage of respondents:\n    - Not at all: 43%\n    - Moderate: 19%\n    - Significantly Relevant: 21%\n    - Very Significantly Relevant: 17%\n\n- **Overlap Section**: Indicates the percentage of overlap between international admissions and funding applications, with segments representing:\n  - 57% (Significantly Relevant)\n  - 23%\n  - 11%\n  - 9%\n\n### Key Takeaways:\n- A significant portion (43%) of respondents believe scholarships have minimal impact on enrollment.\n- Only a collective 57% see significant overlap between admissions and funding processes, indicating a potential area for improvement in aligning these systems to better support international students. \n\nOverall, the figure emphasizes the perceived relevance of financial support mechanisms in the context of international education.",
  "a92433ec-89f3-4095-b0cb-fd7eca7a96bd": "The figure titled \"Survey Responses to the Various Criteria for Approving Funding Requests\" (Figure 2.6) presents a breakdown of faculty perceptions regarding different factors influencing their funding requests. \n\n### Key Elements:\n- **Quadrants**: The figure is divided into four quadrants, each highlighting a specific criterion.\n  - **Relevance to Faculty Research**: 73%\n  - **Importance of the Conference**: 70%\n  - **Expected Outcomes (e.g., publications & networking)**: 64%\n  - **Availability of Funds**: 58%\n  - **Faculty’s Previous Participation in Conferences**: 35%\n\n### Takeaways:\n- The highest responses indicate that relevance to faculty research (73%) and conference importance (70%) are the most critical factors in obtaining funding.\n- Expected outcomes are also significant, though slightly lower at 64%.\n- The availability of funds and faculty participation history are less influential, with only 58% and 35% approval, respectively.\n\nThis data suggests that aligning funding requests with research relevance and the significance of conferences is vital for faculty when seeking funds."
}