[
  {
    "chunk_id": "p1_c1",
    "page": 1,
    "text": "16 Internationalisation of Higher Education in India APPROACHES TO INTERNATIONALISATION: INTERNATIONAL, NATIONAL AND INSTITUTIONAL Chapter 2"
  },
  {
    "chunk_id": "p2_c1",
    "page": 2,
    "text": "17 Approaches to Internationalisation: International, National and Institutional 2.1 OVERVIEW The internationalisation of higher education unfolds along a spectrum from systemic strategies at the country-level to institutional initiatives at the university-level, with each layer reinforcing the other to create a globally competitive education ecosystem. At the systemic level, countries like USA, Canada, Australia, Japan, China, and the European Union have embedded internationalisation into their national/regional policies through scholarship schemes, post-study work pathways, strategic branding, and regulatory frameworks aligning education with broader national goals such as talent retention, soft power, and economic growth. These national priorities set an enabling environment for institutions to act, shaping their recruitment, research, and partnership models. As internationalisation d"
  },
  {
    "chunk_id": "p2_c2",
    "page": 2,
    "text": "priorities set an enabling environment for institutions to act, shaping their recruitment, research, and partnership models. As internationalisation deepens, countries transition from attracting international students to building"
  },
  {
    "chunk_id": "p3_c1",
    "page": 3,
    "text": "18 Internationalisation of Higher Education in India transnational research ecosystems and hybrid campuses. Institutions develop strategies to respond to these trends with targeted investments often with the support of institutional endowments to support global mobility, academic collaborations, faculty exchanges, and global centres. While India’s NEP 2020 outlines an ambitious vision of positioning the country as a global knowledge hub, institutional capacities barring a few leading institutions remain limited, even among the Top 100 NIRF-ranked institutions and Institutes of National Importance (INIs). Nevertheless, emerging models and the growth of strategic endowments in select public and private institutions mark a promising shift towards deeper international engagement. The analysis of this ecosystem from international to national, and from systemic ambition to institutional implem"
  },
  {
    "chunk_id": "p3_c2",
    "page": 3,
    "text": "rds deeper international engagement. The analysis of this ecosystem from international to national, and from systemic ambition to institutional implementation reveals how integrated strategies and cross-level alignment are essential for realising meaningful, sustainable internationalisation. 2.2 INTERNATIONALISING EDUCATION: GLOBAL EXPERIENCE This section provides an overview of the global experience in internationalisation of higher education, setting the context for comparative analysis. The topic is explored in greater depth in the subsequent chapters. 2.2.1 Country Level i. USA Over the past decade, USA has witnessed a significant rise in international student enrolment, growing from 8,19,644 in 2012–13 to 11,26,690 in 2023–24, an increase of approximately 37.5%. In 2023–24 alone, the USA hosted around 11.3 lakh international students, with 3,31,602 (~29%) originating from India. Alt"
  },
  {
    "chunk_id": "p3_c3",
    "page": 3,
    "text": "ase of approximately 37.5%. In 2023–24 alone, the USA hosted around 11.3 lakh international students, with 3,31,602 (~29%) originating from India. Although centralized data on Indian students transitioning to permanent residency is limited, till recently, a large number remained in the US through H‑1B visas and other professional pathways especially in STEM fields reflecting the country’s long standing strategic focus on high-skilled talent retention.1 However, a trend reversal is anticipated with the recent imposition of USD 100,000 fee for new H-1B visa applications.2 The majority of international students in the US come from Asia, primarily India and China, which together account for more than half of the total. Notably, in 2023–24, India overtook China as the largest source country driven by changing geopolitical dynamics and the increasing preference of Indian students for US gradua"
  },
  {
    "chunk_id": "p3_c4",
    "page": 3,
    "text": "a overtook China as the largest source country driven by changing geopolitical dynamics and the increasing preference of Indian students for US graduate and STEM programmes. Institutions in states such as California, Massachusetts, New York, and Texas continue to lead in attracting international students due to their academic prestige, cutting-edge research ecosystems, and robust support structures. In terms of academic levels, there has been a clear shift. Between 2012–13 and 2023–24, graduate international student numbers rose by over 61%, from 3,11,204 to 5,02,2913, while undergraduate enrolment remained relatively flat, growing only slightly from 3,39,993 to 3,42,875 a mere 0.8% increase. This reflects a growing emphasis on advanced degrees and research opportunities, supported by initiatives like the Optional Practical Training (OPT) programme, which until recently offered up to thr"
  },
  {
    "chunk_id": "p3_c5",
    "page": 3,
    "text": "rees and research opportunities, supported by initiatives like the Optional Practical Training (OPT) programme, which until recently offered up to three years of post-study work, particularly in STEM disciplines. However, a new immigration bill in the US Congress (Dignity Act of 2025)4 could end a long-standing tax exemption 1 IE Open Doors. (2025). IIE Open Doors. https://opendoorsdata.org; Fast Facts (2024) : https://opendoorsdata.org/fact_ sheets/fast-facts/ (Accessed in October, 2025) 2 The White House (October 2025): https://www.whitehouse.gov/presidential-actions/2025/09/restriction-on-entry-of- certain-nonimmigrant-workers/ 3 Statista. (2023). Number of international students in the United States from 2004/05 to 2021/23, by academic level. Retrieved from: (Accessed in October, 2025) https://www.statista.com/statistics/237689/international-students-in-the-us- by-academic-level/ 4 N"
  },
  {
    "chunk_id": "p3_c6",
    "page": 3,
    "text": "level. Retrieved from: (Accessed in October, 2025) https://www.statista.com/statistics/237689/international-students-in-the-us- by-academic-level/ 4 National Immigration Forum (October,2025): https://forumtogether.org/article/the-dignity-act-of-2025-bill-summary/"
  },
  {
    "chunk_id": "p4_c1",
    "page": 4,
    "text": "19 Approaches to Internationalisation: International, National and Institutional for international students working under the OPT programme impacting this outcome. These trends highlight how the US linked internationalisation with broader national priorities such as talent acquisition, innovation-led economic growth, and global influence. Signature initiatives like the Fulbright Programme, a flagship academic exchange for international students and scholars, continue to attract global talent and foster long-term academic and diplomatic ties. Beyond tuition revenue estimated at USD 43.8 billion (INR 3,88,725 crores) annually5 (~0.16% of U.S. GDP) international students contribute to the country’s research output, soft power, and global alumni networks. US universities are also active in global student enrolment, transnational education, and strategic partnerships. Common institutional goa"
  },
  {
    "chunk_id": "p4_c2",
    "page": 4,
    "text": "i networks. US universities are also active in global student enrolment, transnational education, and strategic partnerships. Common institutional goals include: z Enhancing the quality of higher education and campus diversity z Building national reputation and competitiveness z Promoting knowledge creation and innovation z Preparing students with multicultural competence for the global workforce z Supporting long-term national economic development ii. Canada Canada has emerged as one of the fastest-growing destinations for international students, witnessing a 48.7% increase from 326,120 in 2014 to 4,85,000 in 2024.6 In 2023, India accounted for 42.9% of all international students in Canada, with 2,33,272 Indian students receiving study permits in Canada, according to official IRCC data7. In 2022, international education directly contributed CAD 30.9 billion (~INR 1.92 lakh crore) to Can"
  },
  {
    "chunk_id": "p4_c3",
    "page": 4,
    "text": "mits in Canada, according to official IRCC data7. In 2022, international education directly contributed CAD 30.9 billion (~INR 1.92 lakh crore) to Canadian GDP, or ~1.2% of the GDP.8 Canada’s internationalisation strategy is primarily built around long-term immigration and workforce integration. z Post-Graduation Work Permit (PGWP): This permit allows international graduates to work in Canada for up to 3 years, offering valuable experience and a pathway to permanent residency. z Student Direct Stream (SDS): SDS enables faster visa processing for students from countries like India, China, Vietnam, and the Philippines, making Canada an attractive destination for international students. z International Education Strategy (2019–2024): This strategy aimed to diversify international student origin countries, encourage Canadian students to study abroad, and promote lasting global partnerships. "
  },
  {
    "chunk_id": "p4_c4",
    "page": 4,
    "text": "tegy aimed to diversify international student origin countries, encourage Canadian students to study abroad, and promote lasting global partnerships. z EduCanada: EduCanada is Canada’s official global branding initiative that showcases the quality and value of Canadian education worldwide. z Global Affairs Canada–SEED Programme: Through programmes like SEED, Global Affairs Canada has promoted academic mobility and development-focused scholarships with partner countries. z High International Student Satisfaction and Retention: Canada is known for strong student 5 International Trade Administration. (2025). Education Service Exports. www.trade.gov. https://www.trade.gov/education- service-exports (Accessed in October, 2025) 6 Immigration, Refugees and Citizenship Canada (IRCC). (2024, October 23). 2024 Annual Report to Parliament on Immigration. https://www.canada.ca/content/dam/ircc/docum"
  },
  {
    "chunk_id": "p4_c5",
    "page": 4,
    "text": "ugees and Citizenship Canada (IRCC). (2024, October 23). 2024 Annual Report to Parliament on Immigration. https://www.canada.ca/content/dam/ircc/documents/pdf/english/corporate/publications-manuals/annual-report-2024- en.pdf 7 Immigration, Refugees and Citizenship Canada (IRCC). (2024, June 26). Intake, Output & Issued – February 28, 2024.https:// www.canada.ca/en/immigration-refugees-citizenship/corporate/transparency/committees/cimm-feb-28-2024/intake- output-issued.html 8 Government of Canada. (2024, June 25). Economic impact of international education in Canada 2022 update. GAC. https:// www.international.gc.ca/education/report-rapport/impact-2022/index.aspx?lang=eng"
  },
  {
    "chunk_id": "p5_c1",
    "page": 5,
    "text": "20 Internationalisation of Higher Education in India support services, and inclusive migration pathways, leading to high satisfaction and retention rates among international students. iii. Australia Australia has experienced a ~50.9% increase9 in international students, growing from 3,47,560 in 2014 to 5,24,514 in 2023. International education has become Australia’s third-largest service export, contributing about AUD 51 billion (~INR 2.85 lakh crore) in 2023-24,10 which accounts for around 1.9% of the country’s GDP. Australia’s appeal lies in its ability to blend high-quality education with post-study migration opportunities. As of September 2023, there were over 1.2 lakh Indian students in Australia11. In the 2023–24 migration programme, Indians were top recipients of permanent residency grants with 49,814 Indians, of which 45,820 were in the Skilled stream and 3,994 in the Family stre"
  },
  {
    "chunk_id": "p5_c2",
    "page": 5,
    "text": "Indians were top recipients of permanent residency grants with 49,814 Indians, of which 45,820 were in the Skilled stream and 3,994 in the Family stream12. Several motivating factors that influence international students to consider Australia as a preferred higher education destination have been listed below: z Temporary Graduate Visa (Subclass 485): Offers 2 to 4 years of post-study work rights based on qualification level and location, supporting Australia’s skilled migration goals. z Destination Australia Programme: Provides scholarships to study in regional institutions and includes incentives for permanent migration, especially in demand-driven regions. z Pathways for Indian Students: Many Indian students move to permanent residency via Subclass 485, followed by skilled migration visas like 189, 190, or 491. z Australia–India Migration and Mobility Partnership (MMPA): This bilateral"
  },
  {
    "chunk_id": "p5_c3",
    "page": 5,
    "text": "a Subclass 485, followed by skilled migration visas like 189, 190, or 491. z Australia–India Migration and Mobility Partnership (MMPA): This bilateral agreement facilitates migration pathways for Indian students and professionals to support mutual skill needs. z Market-Driven, Government-Supported Model: Australia’s international education sector thrives on a combination of strong market appeal and robust national policy support. z ESOS Act (Education Services for Overseas Students): Ensures legal protection and high- quality education standards for international students across Australian institutions. z National Code of Practice: Sets clear responsibilities for universities in supporting international student wellbeing, compliance, and reporting. z Study in Australia Initiative: A global branding and recruitment campaign that promotes Australian education and supports international edu"
  },
  {
    "chunk_id": "p5_c4",
    "page": 5,
    "text": "porting. z Study in Australia Initiative: A global branding and recruitment campaign that promotes Australian education and supports international education fairs. z Australian Strategy for International Education (2021–2030): Focuses on source country diversification, transnational education, alumni engagement, and digital delivery. z Transnational Education Investments: Australian universities lead in offering offshore campuses, online programmes, and academic partnerships across Asia. z Comprehensive Student Support Services: Services such as visa help, housing, language programmes, and mental health support make Australia a preferred global destination for students. iv. European Union (EU) The EU’s strategy for internationalisation is distinct, focusing on equity, inclusion, and intra- regional integration. Although specific data on Indian student−to−migrant conversion is limited 9 A"
  },
  {
    "chunk_id": "p5_c5",
    "page": 5,
    "text": "istinct, focusing on equity, inclusion, and intra- regional integration. Although specific data on Indian student−to−migrant conversion is limited 9 Australian Government. (2025). Student Data - Department of Education, Australian Government. Department of Education. https://www.education.gov.au/higher-education-statistics/student-data 10 Australian Government. (2025, January 9). Education export income - Financial Year - Department of Education, Australian Government. Department of Education. https://www.education.gov.au/international-education-data-and-research/ education-export-income-financial-year 11 High Commission of India in Canberra, Australia. https://www.hcicanberra.gov.in/eoi.php?id=guidelines-for-indian-students- wishing-to-study-in-australia 12 WeAbide (2025). https://www.theweabide.com/post/indian-nationals-lead-australia-s-permanent-residency-outcomes- in-2024"
  },
  {
    "chunk_id": "p6_c1",
    "page": 6,
    "text": "21 Approaches to Internationalisation: International, National and Institutional at the EU level, as of 2023, India has been the third largest country of origin for international students in the EU. Germany (10.1%), Ireland (15.3%) and Latvia (17.4%) have the highest number of Indian students among the EU13. Many Indian students remain in the EU after completing studies through research, employment, or EU Blue Card pathways, especially in STEM fields. The attraction of EU as a study destination for Indian students includes high quality and affordable programmes, English-medium instruction in select countries, research-focused degrees, and availability of post-study work visas or skilled migration options. Over the years, the European Commission has strengthened academic partnerships on a global scale by contributing to the development of several tools aimed at facilitating the mobility o"
  },
  {
    "chunk_id": "p6_c2",
    "page": 6,
    "text": "sion has strengthened academic partnerships on a global scale by contributing to the development of several tools aimed at facilitating the mobility of students and researchers, including: z Europass – a standardised CV and documentation tool for skills and qualifications z ECTS (European Credit Transfer and Accumulation System) – for harmonising credit recognition in higher education z Diploma Supplement – to ensure transparent qualification recognition across countries z European Qualifications Framework for Lifelong Learning (EQF) – aligning national qualification frameworks z ECVET (European Credit System for Vocational Education and Training) – for credit transfer in vocational learning z Youthpass – a certificate tool for non-formal learning in youth programmes z EURAXESS – a portal supporting researcher mobility and career development z Student Visa Directive – easing visa process"
  },
  {
    "chunk_id": "p6_c3",
    "page": 6,
    "text": "earning in youth programmes z EURAXESS – a portal supporting researcher mobility and career development z Student Visa Directive – easing visa processes for non-EU students z Scientific Visa Package – to attract and retain international researchers The Erasmus programme (European Community Action Scheme for Mobility of University Students) was established by the EU in 1987. It aimed to promote closer cooperation between universities and HEIs across Europe. This meant setting up an organised and integrated system of cross- border student interchange. Over time, the programme expanded in its breadth and depth. It was supported by another programme known as the Trans-European Mobility programme for University Studies (TEMPUS) which played a key role in the EU’s strategy. TEMPUS, active from 1990 to 2013, supported the modernisation of higher education in partner countries across Eastern Eur"
  },
  {
    "chunk_id": "p6_c4",
    "page": 6,
    "text": "y role in the EU’s strategy. TEMPUS, active from 1990 to 2013, supported the modernisation of higher education in partner countries across Eastern Europe, Central Asia, the Western Balkans, and the Mediterranean region, primarily through inter-university cooperation projects. The European Commission launched a strategy in 2013 titled ‘European Higher Education in the World’, which aimed at ensuring that European graduates acquire international skills needed to work anywhere in the world, while simultaneously promoting Europe’s attractiveness to international students. Since 2014, a new overarching strategy was developed which was known as “Erasmus+” and combined the vision of both Erasmus and TEMPUS while expanding its scope. Erasmus+ is the EU’s programme from 2021 to 2027 to support education, training, youth and sport in Europe. It funds students and academic staff across EU and partn"
  },
  {
    "chunk_id": "p6_c5",
    "page": 6,
    "text": "e EU’s programme from 2021 to 2027 to support education, training, youth and sport in Europe. It funds students and academic staff across EU and partner countries, and the broader European Higher Education Area (EHEA), which promotes degree recognition and joint quality standards across 49 countries, creating one of the most harmonised academic spaces globally.14 With an estimated budget of €26.2 billion, it supports transnational cooperation aimed at modernising and strengthening education and training systems in response to the current challenges of employment, economic growth, green and digital transition and participation in democratic life. Through the Erasmus+ programme, student mobility grew from 7.4 million in 2014 to 15.1 million 13 Eurostat (2025). https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Learning_mobility_statistics 14 European Education and Culture E"
  },
  {
    "chunk_id": "p6_c6",
    "page": 6,
    "text": "3 Eurostat (2025). https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Learning_mobility_statistics 14 European Education and Culture Executive Agency (EACEA)"
  },
  {
    "chunk_id": "p7_c1",
    "page": 7,
    "text": "22 Internationalisation of Higher Education in India in 2023 (Figure 2.1), representing a 104% increase.15 While economic contributions aren’t directly reported as part of GDP, the EU’s commitment is evident in its €26.2 billion (~INR 2.64 lakh crore) Erasmus+ budget for 2021–2027, reflecting strong support for youth mobility, academic collaboration, and cultural integration. Figure 2.1: Participants in Mobility Activities under the Erasmus+ and its Predecessors since 1987 Source: Erasmus+ Annual Report, 2023 v. Japan Japan has seen a ~93% increase in international student enrolment from 1,61,848 in 2012 to 3,12,214 in 201916. As of 2024, 3,36,708 international students were studying in Japan, of which 0.5% were Indian students.17 While the direct contribution of international students to Japan’s GDP is not publicly reported, the government considers internationalisation critical to addr"
  },
  {
    "chunk_id": "p7_c2",
    "page": 7,
    "text": " direct contribution of international students to Japan’s GDP is not publicly reported, the government considers internationalisation critical to addressing its demographic decline and revitalising regional universities. Key drivers include the Top Global University Project, which seeks to elevate Japanese institutions in global rankings by encouraging international faculty and English-language courses, and MEXT Scholarships, which are fully funded programmes covering tuition and living expenses for international students. These initiatives are part of Japan’s broader vision to enhance academic diplomacy and foster international research collaboration. Japan has recently intensified its efforts to internationalise its higher education sector, aiming to enhance global competitiveness and address domestic demographic challenges. In April 2023, the Japanese Government introduced the J-MIRAI"
  },
  {
    "chunk_id": "p7_c3",
    "page": 7,
    "text": "r, aiming to enhance global competitiveness and address domestic demographic challenges. In April 2023, the Japanese Government introduced the J-MIRAI initiative (Japan Mobility and Internationalisation: Re-engaging and Accelerating Initiative for future generations), setting ambitious targets for 2033. These include attracting 4,00,000 international students and sending 5,00,000 Japanese students abroad, encompassing both long-term degree programmes and short-term exchanges. Beyond numerical goals, J-MIRAI emphasises qualitative improvements, such as doubling English- only undergraduate programmes, increasing joint and dual degree offerings, and enhancing support services for international students. The initiative also seeks to raise the post-graduation employment rate of international students in Japan from 48% to 60% by 2033, fostering better integration into the Japanese workforce. I"
  },
  {
    "chunk_id": "p7_c4",
    "page": 7,
    "text": "ost-graduation employment rate of international students in Japan from 48% to 60% by 2033, fostering better integration into the Japanese workforce. Institutions such as the University of Tokyo are aligning with these national objectives. These efforts reflect Japan’s commitment to cultivating a globally engaged higher education environment, positioning itself as a competitive destination for international students while equipping its own students with global competencies. 15 European Commission – Erasmus+ Annual Report, 2023 16 Japan Student Services Organization. (2020). Result of an annual survey of international students in Japan 2019. Retrieved from https://www.studyinjapan.go.jp/en/_mt/2020/08/date2019z_e.pdf 17 JASSO (Japan Student Services Organization), MEXT. https://www.studyinjapan.go.jp/en/_mt/2025/04/data2024z_e.pdf"
  },
  {
    "chunk_id": "p8_c1",
    "page": 8,
    "text": "23 Approaches to Internationalisation: International, National and Institutional vi. China China’s international student population increased from 3,97,635 in 201518 to 4,92,185 in 201819, marking a ~23.7% growth. China’s internationalisation is aligned with its foreign policy and innovation strategy. They have emerged as a key player in the global higher education landscape through a state-led, strategically coordinated approach to internationalisation. Major national initiatives that have significantly expanded China’s global academic presence include: z Double First-Class Initiative: Aims to develop world-class universities and disciplines by funding elite institutions to improve research capacity, innovation, and global rankings. z Belt and Road Education Action Plan: Promotes educational cooperation with countries along the Belt and Road Initiative through scholarships, student exch"
  },
  {
    "chunk_id": "p8_c2",
    "page": 8,
    "text": " and Road Education Action Plan: Promotes educational cooperation with countries along the Belt and Road Initiative through scholarships, student exchanges, and joint programmes, aligning higher education with China’s foreign policy and soft power goals. z Study in China Strategy: Seeks to position China as a top destination for international students by expanding English-taught programmes, improving student services, and increasing scholarships through the China Scholarship Council (CSC). The Government has invested in improving institutional quality, expanding access to English- medium instruction, and enhancing research output to attract students particularly from Asia and Africa. These measures have made Chinese universities increasingly accessible, competitive, and globally relevant. Alongside its efforts to attract inbound students, China also supports large-scale outbound mobility"
  },
  {
    "chunk_id": "p8_c3",
    "page": 8,
    "text": "y accessible, competitive, and globally relevant. Alongside its efforts to attract inbound students, China also supports large-scale outbound mobility. With over 7 lakh students moving abroad for higher education, it is the second largest source of international students worldwide. Their internationalisation strategy further emphasises global partnerships, academic exchanges, joint research, particularly with institutions in Europe and North America, and participation in international rankings. The Chinese Education Master Plan (2024-2035) focuses on strengthening global talent development and promoting the “Study in China” brand, encouraging high-level foreign universities in science and engineering to offer programmes in China, expanding international academic exchange and research cooperation, actively participating in global education governance, and building international partnershi"
  },
  {
    "chunk_id": "p8_c4",
    "page": 8,
    "text": "international academic exchange and research cooperation, actively participating in global education governance, and building international partnerships and institutions. 2.2.2 Institutional Level The preceding section focused on country-level approaches and programmes across major international ecosystems. This section provides an overview of institution-level interventions in several countries. 2.2.2.1 Institutional Endowments Institutional endowments refer to financial assets, typically in the form of donated funds or investments held by HEIs to support their long-term strategic objectives. While the principal amount is generally preserved, the income generated is used to fund academic activities, scholarships, faculty positions, infrastructure, and international initiatives. At the Institutional level, endowments serve as critical enablers of global academic engagement and institutio"
  },
  {
    "chunk_id": "p8_c5",
    "page": 8,
    "text": "ructure, and international initiatives. At the Institutional level, endowments serve as critical enablers of global academic engagement and institutional development. They provide long-term financial stability and allow universities to invest strategically in initiatives that enhance their global presence and competitiveness. Endowments not only legitimise internationalisation efforts but also ensure their sustainability over time. The size of institutional endowments can positively impact international student enrolment, global research output, the ability to offer scholarships, and expansion through international campuses and partnerships. 18 Ministry of Education and Training, Australian Government (Aug, 2016). https://internationaleducation.gov.au/research/ Research-Snapshots/Documents/China_outbound%20and%20inbound%20tertiary%20students.pdf 19 Ministry of Education, China (2018). ht"
  },
  {
    "chunk_id": "p8_c6",
    "page": 8,
    "text": "tion.gov.au/research/ Research-Snapshots/Documents/China_outbound%20and%20inbound%20tertiary%20students.pdf 19 Ministry of Education, China (2018). http://en.moe.gov.cn/documents/reports/201904/t20190418_378692.html"
  },
  {
    "chunk_id": "p9_c1",
    "page": 9,
    "text": "24 Internationalisation of Higher Education in India i. Endowment as Enabler Global examples show how endowments can drive educational outcomes and institutional growth by supporting the following key areas: z Financial support: Scholarships for international students, research grants for global collaborations, infrastructure development for international programmes and support for faculty exchange and development. z Infrastructure development: Establishment of international campuses, creation of research facilities, development of technology platforms and building of student housing and facilities. z Programme development: Creation of international curricula, development of exchange programmes, establishment of joint degree programmes, and support for international accreditation. z Research support: Funding for international research projects, support for global research centres, resour"
  },
  {
    "chunk_id": "p9_c2",
    "page": 9,
    "text": " support for international accreditation. z Research support: Funding for international research projects, support for global research centres, resources for international publications, and grants for collaborative research. z Network building: Development of international alumni networks, creation of global institutional partnerships, support for industry collaborations and building of academic consortia. ii. Leveraging Institutional Endowments: Global Examples Table 2.1 provides examples from the USA, UK, Asia, Canada, and Europe on how endowments have supported key international initiatives such as global research centres, joint academic programmes, scholarships for international students, and international faculty recruitment and the outcomes they have achieved in terms of global rankings, student diversity, and cross-border collaboration. Top global universities such as Harvard, Yal"
  },
  {
    "chunk_id": "p9_c3",
    "page": 9,
    "text": "tcomes they have achieved in terms of global rankings, student diversity, and cross-border collaboration. Top global universities such as Harvard, Yale, and Stanford strategically utilise their institutional endowments to strengthen internationalisation. The endowments range from USD 27.2 billion to over USD 50 billion and investments contribute directly to global impact, as reflected in the high proportions of international students and international faculty at these institutions. Table 2.1: Global Practices of Leveraging Institutional Endowments University Endowment INR (In approx. crores) Exchange Rate (Oct 2025) Key International Initiatives International Outcomes Harvard University (USA) USD 52.3 billion20 4,64,162 1 USD = ₹88.75 20+ global research centres 24% international students Financial aid for 50% of international students Consistently top global ranking Partnerships with 57"
  },
  {
    "chunk_id": "p9_c4",
    "page": 9,
    "text": "lobal research centres 24% international students Financial aid for 50% of international students Consistently top global ranking Partnerships with 57 countries Faculty exchanges in 30+ nations Cambridge University (UK) £2.6 billion21 39,890 1 GBP = ₹119.0 Cambridge-Africa Programme 24% international faculty Research hubs in Singapore, India, China 40% international students Global fellowship programmes 20 https://www.harvard.edu/about/endowment/ 21 https://www.cam.ac.uk/about-the-university/how-the-university-and-colleges-work/cambridge-university-endowment- fund"
  },
  {
    "chunk_id": "p10_c1",
    "page": 10,
    "text": "25 Approaches to Internationalisation: International, National and Institutional University Endowment INR (In approx. crores) Exchange Rate (Oct 2025) Key International Initiatives International Outcomes NUS (Singapore) SGD 5.9 billion22 39,852 1 SGD = ₹68.5 Yale-NUS College Ranked in global top 20 Duke-NUS Medical School Research ties with 20+ countries Tsinghua University (China) USD 3.9 billion 34,612 1 USD = ₹88.75 Belt & Road Initiative collaborations 300% growth in international enrolment (since 2010) Global Innovation Exchange Southeast Asia partnerships Toronto University (Canada) CAD 3.15 billion23 19,587 1 CAD = ₹63.5 International doctoral scholarships 25% international student population Research in 170+ countries Global innovation hubs ETH Zurich (Switzerland) CHF 804 million24 14,791 1 CHF = ₹111.0 Singapore-ETH Centre 40% international faculty Global research stations Inte"
  },
  {
    "chunk_id": "p10_c2",
    "page": 10,
    "text": "ion hubs ETH Zurich (Switzerland) CHF 804 million24 14,791 1 CHF = ₹111.0 Singapore-ETH Centre 40% international faculty Global research stations International faculty recruitment These examples of select top universities in the respective countries, demonstrate the pivotal role of financial endowments in enabling and sustaining international outreach. Institutions with strong endowments are able to fund student scholarships, support international research, build global infrastructure, and foster meaningful partnerships. The outcomes include increased international student enrolment, greater faculty diversity, and enhanced global visibility. These are precisely the goals that many Indian institutions seek to achieve as they pursue internationalisation. 2.2.2.2 Models of International Engagement Two models in this context are - Global Centres and Hybrid Joint Campuses. Global Centres and "
  },
  {
    "chunk_id": "p10_c3",
    "page": 10,
    "text": "onalisation. 2.2.2.2 Models of International Engagement Two models in this context are - Global Centres and Hybrid Joint Campuses. Global Centres and Hybrid Joint Campuses represent innovative models of international collaboration that go beyond traditional offshore campuses. Unlike offshore campuses, which require significant capital investment and time to replicate institutional culture and infrastructure, these models operate with smaller physical footprints and can be hosted within existing international offices. They allow HEIs to focus on strategic areas such as collaborative research, joint degrees, and curriculum exchange while expanding global physical presence at a smaller scale. They resolve the international collaboration needs of HEIs as reflected in survey responses without significant investment. (Figure 2.2) By leveraging partnerships, alumni networks, and research collab"
  },
  {
    "chunk_id": "p10_c4",
    "page": 10,
    "text": "of HEIs as reflected in survey responses without significant investment. (Figure 2.2) By leveraging partnerships, alumni networks, and research collaborations, they offer flexible, cost-effective avenues for sustained international engagement and institutional growth. 22 https://www.straitstimes.com/politics/parliament-nus-has-largest-endowment-fund-of-59-billion-followed-by-ntu-with- 19-billion 23 https://www.intentionalendowments.org/university_of_toronto 24 https://report23.ethz-foundation.ch/en/"
  },
  {
    "chunk_id": "p11_c1",
    "page": 11,
    "text": "26 Internationalisation of Higher Education in India Figure 2.2: Survey Response on Various Objectives for Partnerships Note: Since the respondents could choose more than one objective, the percentages do not cumulatively add to 100. i. Global Centres A Global Centre is loosely defined as an international presence for a university, serving as a nucleus for various activities including providing technology transfer opportunities, undertaking industry or other sponsored research abroad, and enabling academic programmes. The centre leverages the university’s strengths to serve the host country’s needs and meet global challenges by acting as a local hub. Top universities have already established global centres to achieve some of these aspirations. Across 11 cities, Columbia University’s Global Centres provide an avenue for international collaboration in research, education, and public engage"
  },
  {
    "chunk_id": "p11_c2",
    "page": 11,
    "text": "ns. Across 11 cities, Columbia University’s Global Centres provide an avenue for international collaboration in research, education, and public engagement.25 Apart from serving as local hubs in India, China, Kenya, and other countries, they also function as an important network that fuels the global aspirations of the University. New York University’s 14 Global Centres are each focused on a different theme. For example, the centre in Accra, Ghana, deals with African studies whereas the centre in Paris, France, focuses on French culture.26 The University of Chicago’s Global Centres in 3 cities across the world are more focused on international dialogues with the host countries, apart from academic exchanges. The Global Research Centers of Harvard Business School facilitate faculty research and case development on an international scale across 17 cities. These enable Harvard faculty to wor"
  },
  {
    "chunk_id": "p11_c3",
    "page": 11,
    "text": "rvard Business School facilitate faculty research and case development on an international scale across 17 cities. These enable Harvard faculty to work with leaders, industry, government, and academia worldwide, and to learn from business challenges and innovations wherever they occur.27 Table 2.2: A comparison of Global Centres Across the World University/ Centre Year Locations (outside home country) Focus Area Features and Offerings Columbia University Global Centres28 2009 10 cities including Amman, Athens, Beijing, Istanbul, Mumbai, Nairobi, Paris, Rio de Janeiro, Tel Aviv, Tunis International collaboration, research projects, academic programming, study abroad Various programmes in public health, environmental sustainability, architecture, and more. 25 Columbia University. (n.d.). Global Centers. Columbia Global Centers. https://globalcentres.columbia.edu/ 26 New York University. (n"
  },
  {
    "chunk_id": "p11_c4",
    "page": 11,
    "text": "ure, and more. 25 Columbia University. (n.d.). Global Centers. Columbia Global Centers. https://globalcentres.columbia.edu/ 26 New York University. (n.d.). Global Academic Centers. In Liberal Studies Bulletin. https://liberalstudies.nyu.edu/academics/ liberalstudiesbulletin/global-academic-centers.html 27 https://www.hbs.edu/about/history 28 Columbia University. (n.d.). Global Centers. Columbia Global Centers. https://globalcentres.columbia.edu/"
  },
  {
    "chunk_id": "p12_c1",
    "page": 12,
    "text": "27 Approaches to Internationalisation: International, National and Institutional University/ Centre Year Locations (outside home country) Focus Area Features and Offerings NYU Global Academic Centres29 2012 12 cities including Abu Dhabi, Accra, Berlin, Buenos Aries, Florence, London, Madrid, Paris, Prague, Shanghai, Sydney, Tel Aviv Study away programmes, global research initiatives Undergraduate and graduate programmes across various disciplines in cities like Paris, Berlin, and Sydney. University of Chicago Global Centre30 2003 2010 2013 3 cities including Beijing, Delhi, Paris Science, energy, medicine, public health; business, economics, policy; culture, society, law Academic and public programmes addressing global issues, serve as a hub for scholars and alumni. Harvard Global Research Centres31 1999 2000 2002 2003 2006 2013 2017 16 cities including Johannesburg, Lagos, Nairobi, Hong"
  },
  {
    "chunk_id": "p12_c2",
    "page": 12,
    "text": "b for scholars and alumni. Harvard Global Research Centres31 1999 2000 2002 2003 2006 2013 2017 16 cities including Johannesburg, Lagos, Nairobi, Hong Kong, Shanghai, Singapore, Paris, Mumbai, Tel Aviv, Tokyo, Mexico City, Sao Paulo, Montevideo, Cairo, Dubai, Istanbul Business and Environment, Business History, Entrepreneurship, Finance, Globalization, Health Care , Human Behaviour and Decision-Making, Leadership, Social Enterprise, Technology and Innovation Faculty research and international case study development across a variety of subjects and sectors. ii. Hybrid Joint Campuses Similar to joint degree programmes, there are many advantages in a combined effort by two or more international partners toward establishing and operating a joint campus. The reputation of both the universities is leveraged in this initiative, and a deep, multidimensional and strategic collaboration is envisag"
  },
  {
    "chunk_id": "p12_c3",
    "page": 12,
    "text": "t campus. The reputation of both the universities is leveraged in this initiative, and a deep, multidimensional and strategic collaboration is envisaged for transnational impact. Resources are shared, and knowledge and technology transfer of global relevance is made possible through hybrid joint campuses. The physical space requirements are minimal, with offices, laboratories and other spaces distributed across each of the original campuses. Faculty across the two universities are formally associated with such campuses through joint appointments. Funding for physical mobility for faculty and students between the two institutions is provided. Students in both universities participate in joint campus activities, and the collaboration includes, but is not limited to joint degree programmes. The universities grow together in partnership, with dedicated funding and identified thematic areas f"
  },
  {
    "chunk_id": "p12_c4",
    "page": 12,
    "text": ", but is not limited to joint degree programmes. The universities grow together in partnership, with dedicated funding and identified thematic areas for an in-depth collaboration. Global Practice: TransCampus Initiative An implementation of this model is the transCampus initiative, a strategic collaboration between King’s College London and Dresden University of Technology32. Established in 2013, the academic platform includes joint research projects and PhD programmes, focusing on synergy in areas including haematology, diabetes and mental health research. Two separate but coordinated offices are maintained in London (UK) and Dresden (Germany). Several faculty members across both institutions are onboarded as Associated Professors and Project Principal Investigators. The transCampus partnership offers staff exchange and training programmes for students from both universities, thereby cr"
  },
  {
    "chunk_id": "p12_c5",
    "page": 12,
    "text": "ect Principal Investigators. The transCampus partnership offers staff exchange and training programmes for students from both universities, thereby creating an international ecosystem of students and faculty collaborating across disciplines. 29 New York University. (2025, April 2). NYU Global Study Abroad/Away. https://tisch.nyu.edu/special-programs/global- programs.html 30 University of Chicago. (n.d.). Global campuses and centres. https://www.uchicago.edu/education-and-research/global- campuses-and-centres 31 https://www.hbs.edu/about/history 32 TU Dresden.TransCampus: Partnerships and cooperation. Hochschulpartnerschaften - transCampus — Internationales — TU Dresden"
  },
  {
    "chunk_id": "p13_c1",
    "page": 13,
    "text": "28 Internationalisation of Higher Education in India 2.3 COMPARATIVE ANALYSIS OF INTERNATIONALISATION STRATEGIES AND LEARNINGS FOR INDIA This section briefly highlights how different countries have built competitive higher education ecosystems. As depicted in Figure 2.3, while the USA focuses on research funding and global recognition, countries such as Germany leverage low-cost, high-quality education. China has made large-scale investments in infrastructure and scholarships, while Australia and the UK have prioritised international student experience and cultural integration. Figure 2.3: Global Internationalisation Strategies Source: The information is based on extensive stakeholder consultations, including workshops, national and international KIIs and survey responses. India has a unique opportunity to shape its internationalisation strategy by blending global best practices with its"
  },
  {
    "chunk_id": "p13_c2",
    "page": 13,
    "text": "tional KIIs and survey responses. India has a unique opportunity to shape its internationalisation strategy by blending global best practices with its own intellectual and cultural strengths. Its emerging model is being shaped by its cost advantage, expertise in technical and professional education, ICT strength, cultural heritage, and English-medium instruction. As a cost-effective, English-speaking, and tech-savvy nation, India appeals especially to students from the Global South, but its potential extends far beyond affordability. India’s expertise in basic sciences, engineering, management, and professional education has built a globally competitive talent pool. Graduates from institutions like the IITs, IIMs, IISc, and other Institutes of National Importance and Eminence have made significant contributions across sectors such as technology, healthcare, finance, and entrepreneurship."
  },
  {
    "chunk_id": "p13_c3",
    "page": 13,
    "text": " of National Importance and Eminence have made significant contributions across sectors such as technology, healthcare, finance, and entrepreneurship. This robust foundation has enabled the Indian diaspora to excel in diverse professions worldwide. There is a need to provide visibility to this expertise in order to make India an attractive destination for Higher Education. Additionally, Indian Knowledge System (IKS) encompassing fields like philosophy and literature, Ayurveda and Yoga, Vedic mathematics and astronomy, arts and architecture, governance and statecraft, and climate and sustainability, among many others, offers globally applicable, and interdisciplinary insights. By integrating IKS with curricula, promoting research collaborations, enabling post-study work opportunities, and aligning academic pathways with global standards, India can position itself as a distinct contributor"
  },
  {
    "chunk_id": "p13_c4",
    "page": 13,
    "text": "ons, enabling post-study work opportunities, and aligning academic pathways with global standards, India can position itself as a distinct contributor and destination for global higher education. 2.4 INDIAN EXPERIENCE OF INTERNATIONALISING EDUCATION As outlined in NEP 2020, India aspires to become a globally attractive destination for higher education."
  },
  {
    "chunk_id": "p14_c1",
    "page": 14,
    "text": "29 Approaches to Internationalisation: International, National and Institutional Between 2012 and 2022, inbound international student numbers grew by 34%, reaching a peak of 46,878 in 2021–22. However, international students have consistently accounted for only a small share between 0.5% and 0.11% of India’s total higher education enrollment over the past 25 years. In comparison, leading host countries like the USA (11,26,690), Canada (842,760), the UK (7,58,855), Australia (4,37,485), and China (2,00,892) (cited from Section 2.2) attract significantly higher numbers and feature prominently among the world’s top 10 destinations for international students. This stark contrast underscores that India’s current international student inflow remains limited in global terms. To bridge this gap and realise its ambitions, India must scale up efforts to attract international researchers and facult"
  },
  {
    "chunk_id": "p14_c2",
    "page": 14,
    "text": "ins limited in global terms. To bridge this gap and realise its ambitions, India must scale up efforts to attract international researchers and faculty, strengthen international research collaborations, and forge robust academic partnerships. Some policy-level measures have already been introduced to catalyse this shift as discussed below. 2.4.1 Country Level i. Study in India Programme India’s ambition to become a global education destination is reflected in the launch of the Study in India (SII) programme in 2018 by the Ministry of Education. Conceived as an initiative to strengthen India’s inbound student mobility, SII aims to position Indian HEIs as an attractive alternative to traditional study-abroad destinations particularly for students from the Global South. However, despite early progress, the SII initiative has not met its target of hosting 2,00,000 international students by 2"
  },
  {
    "chunk_id": "p14_c3",
    "page": 14,
    "text": "ents from the Global South. However, despite early progress, the SII initiative has not met its target of hosting 2,00,000 international students by 2023. Creating SII 2.0 with comprehensive Branding, Communication, and Outreach (BCO) strategies (as outlined in the policy recommendations of this report) would be essential to attract international students to India. It may also focus on supporting short- term academic exchanges that allow international students to study in India for part of their degree, or Indian students to spend a limited period abroad. This form of mobility can play a vital role in fostering international collaborations. 2.4.2 Institutional Level 2.4.2.1 Institutional Endowments While Indian HEIs have historically depended primarily on government funding, there has been a growing recognition of the importance of institutional endowments in achieving long-term goals, i"
  },
  {
    "chunk_id": "p14_c4",
    "page": 14,
    "text": "ed primarily on government funding, there has been a growing recognition of the importance of institutional endowments in achieving long-term goals, including internationalisation. In recent years, several leading institutions have launched or expanded endowment initiatives often supported by alumni and private donors to build global partnerships, fund scholarships, and enhance research infrastructure. i. Indian Practices of Building Institutional Endowments Table 2.3 highlights select Indian institutions that are pioneering this approach. Though still modest in scale compared to global counterparts, these efforts signal a shift toward greater financial autonomy, strategic international engagement, and institutional innovation."
  },
  {
    "chunk_id": "p15_c1",
    "page": 15,
    "text": "30 Internationalisation of Higher Education in India Table 2.3: Endowment Driven Examples of INIs Institution Launch Year Endowment Fund Amount Impact / Outcomes As On IIT Delhi33 2019 z Target Amount: INR 10,000 crore by 2029 supported by alumni and industry z Amount Raised: INR 500 crore pledged donations z No. of donors: 425+ Mittal Sports Complex, Yardi AI School, Duggal Climate Centre, student scholarships, among others December 2025 IIM Ahmedabad34 2020 z Target Amount: INR 1,000 crores by 2025 through donors and alumni z Amount Raised: INR 615+ crores (Total commitment) and INR 400+ crores (Raised) z No. of donors: 360+ 1 new school, 5 research centres, 7 endowed chairs, among others December 2025 These examples demonstrate the emerging potential of Indian endowments to support internationally competitive institutions. ii. Constraints in Scaling up Endowment Model in India While t"
  },
  {
    "chunk_id": "p15_c2",
    "page": 15,
    "text": "ing potential of Indian endowments to support internationally competitive institutions. ii. Constraints in Scaling up Endowment Model in India While there is no single act for endowment funds in India, a combination of central laws (Charitable Endowments Act 1890, Income Tax Act 1961) and sector-specific statutes (such as university or institutional acts or guidelines) collectively provide the regulatory framework for endowment funds in India. Institutions must also ensure compliance with FCRA if handling foreign funds. Institutional endowments hold immense potential to support internationalisation in higher education, but several challenges hinder their effective establishment in the Indian context. Key constraints include: z Regulatory Hurdles at Central-level: The regulatory framework in India is not yet fully conducive to encouraging and facilitating endowment growth in the higher ed"
  },
  {
    "chunk_id": "p15_c3",
    "page": 15,
    "text": "rdles at Central-level: The regulatory framework in India is not yet fully conducive to encouraging and facilitating endowment growth in the higher education sector with lack of clear guidelines on deployment of endowment funds and utilisation of endowment income. z Limited Fundraising Capacity at Institutional-level: HEIs struggle with raising significant endowment funds due to a lack of an established culture of alumni donations or low financial capacity among alumni compared to leading HEIs. z Lack of Fund Sustainability and Expertise: Institutions face difficulty in sustaining endowment funds due to absence of professional fund management systems. z Absence of Reinvestment Strategy: There is a lack of defined mechanisms to generate income and reinvest it in alignment with internationalisation priorities. Addressing these constraints through regulatory reform, capacity building, and s"
  },
  {
    "chunk_id": "p15_c4",
    "page": 15,
    "text": "me and reinvest it in alignment with internationalisation priorities. Addressing these constraints through regulatory reform, capacity building, and strategic financial planning is essential to unlock the full potential of endowments in advancing the internationalisation agenda of Indian higher education institutions. 2.4.2.2 Indian HEIs International Engagement Models Select Indian HEIs have started espousing the practice of establishing Global Centres, though none have ventured to establish a Hybrid Joint Campus as seen in other countries. While such innovations are new for the Indian higher education system, their success and the rising 33 https://endowment.iitd.ac.in/ 34 https://endowment.iima.ac.in/"
  },
  {
    "chunk_id": "p16_c1",
    "page": 16,
    "text": "31 Approaches to Internationalisation: International, National and Institutional dominance of Indian technology and education on the global stage can spur more Indian HEIs to consider this and other models. i. Global Centres IIT Madras Global Centre IIT Madras was the first Indian public HEI to establish an international centre in Dubai in 202435. The IITM Global Dubai Centre will specialised in cutting-edge fields such as artificial intelligence (AI), data science, robotics, and sustainable energy and create a new bridge to India’s entrepreneurial ecosystem. The Institute’s plans to establish the Centre in Dubai has been facilitated through an agreement between Indian Institute of Technology, Madras (IITM) and the Dubai Department of Economy and Tourism (DET). Figure 2.4 depicts the pillars of activities on which this centre, termed “IITM Global”, is based. It focuses on research, techn"
  },
  {
    "chunk_id": "p16_c2",
    "page": 16,
    "text": "my and Tourism (DET). Figure 2.4 depicts the pillars of activities on which this centre, termed “IITM Global”, is based. It focuses on research, technology transfer and bespoke academic skilling programme opportunities, within the domain of frontier technology. IITM’s approach to the Global Centre emphasises connection with global markets for technologies and short-term programmes. Figure 2.4: Pillars of IITM Global 2.5 CHALLENGES IN INTERNATIONALISATION OF INDIAN HEIs Based on the primary and secondary data analysed for this study, the key challenges in the effective internationalisation of education in India can be summarised as follows: i. Systemic-level The following challenges at the systemic level hinder India’s global academic appeal: z Academic: There is a need to match the global academic curricula and industry alignment. Currently, there are limited opportunities for internatio"
  },
  {
    "chunk_id": "p16_c3",
    "page": 16,
    "text": ": z Academic: There is a need to match the global academic curricula and industry alignment. Currently, there are limited opportunities for international faculty exchange and research. z Administrative: Complicated visa procedures, lack of a comprehensive branding, marketing and outreach strategy, and limited scholarships. z Infrastructural: Upgradation of infrastructure and technology according to international standards, and the need for enhancing R&D resources. z Student Experience: Challenges with respect to cultural adaptation, language barriers, and job placement. 35 Times of India. (2024, March 11). IIT Madras to launch first international centre in Dubai focusing on AI and innovation. https://timesofindia.indiatimes.com/education/news/iit-madras-to-launch-first-international-centre-in-dubai-focusing- on-ai-and-innovation/articleshow/114353729.cms"
  },
  {
    "chunk_id": "p17_c1",
    "page": 17,
    "text": "32 Internationalisation of Higher Education in India z Support Services: housing, and student support services impact the quality of life and impact the overall experience of students in the country. ii. Institutional-level According to the survey conducted in Indian HEIs, the following are some of the key hindrances with respect to research collaborations at the institutional level: z Lack of Integration of Scholarships with Admissions: 38% of respondents view scholarships as crucial for student mobility. However, 57% report no coordination between funding bodies and admissions offices. (Figure 2.5)This disconnect limits the effectiveness of financial support in attracting international students. Figure 2.5: Survey Responses to Financial Support Offered through Various Means z Faculty Internationalisation is Ad Hoc: While 73% of institutions cite research relevance, 70% importance of th"
  },
  {
    "chunk_id": "p17_c2",
    "page": 17,
    "text": "upport Offered through Various Means z Faculty Internationalisation is Ad Hoc: While 73% of institutions cite research relevance, 70% importance of the conference, and 64% expected outcomes when approving faculty funding, only 58% consider fund availability, and 35% account for past participation for faculty-led research (Fig. 2.6). This reflects a lack of strategic, long-term investment in international faculty engagement. Figure 2.6: Survey Responses to the Various Criteria for Approving Funding Requests Note: Since the respondents could choose more than one objective, the percentages do not cumulatively add to 100. These insights underscore the need for institutions to move beyond ad hoc financial decisions and develop coherent, forward-looking funding strategies. Strengthening governance frameworks, aligning funding cycles with strategic goals, and integrating support for both facult"
  },
  {
    "chunk_id": "p17_c3",
    "page": 17,
    "text": "looking funding strategies. Strengthening governance frameworks, aligning funding cycles with strategic goals, and integrating support for both faculty and students"
  },
  {
    "chunk_id": "p18_c1",
    "page": 18,
    "text": "33 Approaches to Internationalisation: International, National and Institutional into internationalisation plans will be crucial. Such an approach will be key to unlocking the full potential of institutional endowments and advancing India’s aspirations in global higher education. Indian Higher Education has found its way into this model recently as well. With the various NEP 2020 enablements for the possibility of earning academic credits, a strategically evolved effort is important for Indian HEIs.36 2.6 KEY TAKEAWAYS An analysis of various country-level and institution-level strategies reveals that those excelling in the internationalisation space have developed context-specific approaches tailored to their unique needs and priorities. India too needs to formulate a comprehensive national strategy for internationalisation of higher education. Its success will depend on leveraging the p"
  },
  {
    "chunk_id": "p18_c2",
    "page": 18,
    "text": "dia too needs to formulate a comprehensive national strategy for internationalisation of higher education. Its success will depend on leveraging the power of the world’s largest diaspora, establishment of clear implementation mechanisms, sustained institutional commitment from universities, and well-coordinated actions to overcome practical challenges. Therefore, both at the systemic and institutional levels, India needs to design contextually grounded strategies informed by global best practices to effectively advance the internationalisation of higher education. 36 TU Dresden. (2023, October 20). Brückenschlag zwischen zwei der innovativsten Wissenschaftsgemeinschaften der Welt: TU Dresden und IIT Madras gründen TransCampus-Partnerschaft. https://tu-dresden.de/tu-dresden/newsportal/news/ brueckenschlag-zwischen-zwei-der-innovativsten-wissenschaftsgemeinschaften-der-welt-tu-dresden-und-"
  },
  {
    "chunk_id": "p18_c3",
    "page": 18,
    "text": " https://tu-dresden.de/tu-dresden/newsportal/news/ brueckenschlag-zwischen-zwei-der-innovativsten-wissenschaftsgemeinschaften-der-welt-tu-dresden-und-iit-madras- gruenden-transcampus-partnerschaft?set_language=en"
  }
]